benchmark/results/20260610_192252/read_committed_c100_j16.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 16
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 35589
number of failed transactions: 0 (0.000%)
latency average = 13.517 ms
initial connection time = 224.322 ms
tps = 7398.097644 (without initial connection time)