benchmark/results/20260610_192252/read_committed_c100_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 8
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 35653
number of failed transactions: 0 (0.000%)
latency average = 13.437 ms
initial connection time = 250.890 ms
tps = 7442.108814 (without initial connection time)