benchmark/results/20260610_192252/read_committed_c10_j16.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 29801
number of failed transactions: 0 (0.000%)
latency average = 1.669 ms
initial connection time = 32.814 ms
tps = 5991.652581 (without initial connection time)