benchmark/results/20260610_192252/serializable_c100_j16.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 16
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 20621
number of failed transactions: 0 (0.000%)
latency average = 23.330 ms
initial connection time = 252.339 ms
tps = 4286.268973 (without initial connection time)