benchmark/results/20260610_192252/serializable_c10_j16.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 20270
number of failed transactions: 0 (0.000%)
latency average = 2.456 ms
initial connection time = 32.302 ms
tps = 4072.198656 (without initial connection time)